[
    {
        "role":"Sr. Cloud Application Architect",
        "company":"Amazon Web Services (AWS)",
        "range":"March 2020 - Present"
    },
    {
        "role":"Sr. Technical Account Manager",
        "company":"Amazon Web Services (AWS)",
        "range":"June 2019 - March 2020"
    },
    {
        "role":"Principal Engineer (The Container Guy)",
        "company":"Trace3",
        "summary":"Leading DevOps and Container transformations",
        "range":"July 2017 - June 2019"
    },
    {
        "role":"Solutions Architect",
        "company":"Minerva Group, LLC",
        "summary":"We are a venture capital group that invests intellectual equity to transform ideas into successful products. The core company of Minerva is a think tank of experienced technologists who are passionate about the goal of building products that change the way people interact with their world. We focus on building products that take everyday tasks and interactions of our users and fundamentally improve them. Every employee has a chance to become part of the equity of the company, and thus have an owner’s stake in all of Minerva's brands. This fosters a culture of ownership internally that ensures we deliver the best results.",
        "range":"May 2015 - July 2017"
    },
    {
        "role":"Manager, UX Development",
        "company":"Charter Communications ",
        "summary":"Worked on proprietary Javascript framework to run on cable boxes. Worked with back end teams to develop APIs, and troubleshoot issues through multiple departments and vendors. Wrote unit testable code, and code reviewed developers. Provided network support to a team of 100 people. Managed development of a company wide product release site.",
        "range":"August 2014 - May 2015"
    },
    {
        "role":"Developer",
        "company":"LRXD",
        "summary":"Developed and maintained Ruby on Rails customer loyalty application. Developed a responsive admin panel for doctor’s office email management system. Setup and maintained Jenkins continuous deployment server.",
        "range":"March  2014 – August 2014"
    },
    {
        "role":"Developer",
        "company":"Crispin Porter & Bogusky",
        "summary":"Developed websites for large brands such as Kraft and American Express. Worked with clients on problem solving and architecture planning. Worked with and developed proprietary APIs. Worked with creatives in order to build marketing campaigns. Mentored junior developers and interns.",
        "range":"January  2013 – February 2014"
    },
    {
        "role":"Entrepreneur/Developer",
        "company":"Tritium Studios",
        "summary":"Founded and manage web development company for small and medium sized companies. Manage both employees and independent contractors. Consult with businesses regarding the development of their digital and marketing strategy.",
        "range":"April 2011 – December 2012"
    },
    {
        "role":"Technology Intern",
        "company":"R/GA",
        "summary":"Worked on and tested mobile applications for Nike. Developed client documentation for Verizon. Updated Nokia’s development and testing site for their worldwide kiosk system. Worked on and developed PHP web applications.",
        "range":"June 2010 – August 2010"
    },
    {
        "role":"Engineering Intern",
        "company":"Skanska USA Building Inc.",
        "summary":"Designed and Developed Excel and Access database systems for creating metrics of accounts payable. Researched and prepared a report on green technology to be distributed within the organization.",
        "range":"June 2009 – August 2009"
    },
    {
        "role":"Mutual Fund Analyst Intern",
        "company":"Joseph Gunnar & Co, LLC",
        "summary":"Created Excel spreadsheets to analyze mutual funds, and present the results in a usable form. Designed manual of the companies mutual fund software, in order to assist brokers.",
        "range":"June 2008 – August 2008"
    }
]
